VSabouhi/Talma_NodeBoard_Git/Talma_NodeBoard_Git.ioc
PH12.Locked=true
PH12.PinState=GPIO_PIN_SET
PH12.Signal=GPIO_Output
PH13.GPIOParameters=PinState,GPIO_Label
PH13.GPIO_Label=Pix32_Dir
PH13.Locked=true
PH13.PinState=GPIO_PIN_RESET
PH13.Signal=GPIO_Output
PH14.GPIOParameters=PinState,GPIO_Label
PH14.GPIO_Label=Pix32_PW
PH14.Locked=true
PH14.PinState=GPIO_PIN_SET
PH14.Signal=GPIO_Output
PH15.GPIOParameters=PinState,GPIO_Label
PH15.GPIO_Label=Pix33_Xs
PH15.Locked=true
PH15.PinState=GPIO_PIN_SET
PH15.Signal=GPIO_Output
PH2.GPIOParameters=PinState,GPIO_Label
PH2.GPIO_Label=Pix15_Xs
PH2.Locked=true
PH2.PinState=GPIO_PIN_SET
PH2.Signal=GPIO_Output
PH3.GPIOParameters=PinState,GPIO_Label
PH3.GPIO_Label=Pix16_PW
PH3.Locked=true
PH3.PinState=GPIO_PIN_SET
PH3.Signal=GPIO_Output
PH4.GPIOParameters=PinState,GPIO_Label
PH4.GPIO_Label=Pix16_Dir
PH4.Locked=true
PH4.PinState=GPIO_PIN_RESET
PH4.Signal=GPIO_Output
PH5.GPIOParameters=PinState,GPIO_Label
PH5.GPIO_Label=Pix16_En
PH5.Locked=true
PH5.PinState=GPIO_PIN_SET
PH5.Signal=GPIO_Output
PH6.GPIOParameters=PinState,GPIO_Label
PH6.GPIO_Label=Pix22_PW
PH6.Locked=true
PH6.PinState=GPIO_PIN_SET
PH6.Signal=GPIO_Output
PH7.Mode=I2C
PH7.Signal=I2C3_SCL
PH8.Mode=I2C
PH8.Signal=I2C3_SDA
PH9.GPIOParameters=PinState,GPIO_Label
PH9.GPIO_Label=Pix23_Xs
PH9.Locked=true
PH9.PinState=GPIO_PIN_SET
PH9.Signal=GPIO_Output
PI0.GPIOParameters=PinState,GPIO_Label
PI0.GPIO_Label=Pix33_En
PI0.Locked=true
PI0.PinState=GPIO_PIN_SET
PI0.Signal=GPIO_Output
PI1.GPIOParameters=PinState,GPIO_Label
PI1.GPIO_Label=Pix33_Dir
PI1.Locked=true
PI1.PinState=GPIO_PIN_SET
PI1.Signal=GPIO_Output
PI10.GPIOParameters=PinState,GPIO_Label
PI10.GPIO_Label=Pix10_En
PI10.Locked=true
PI10.PinState=GPIO_PIN_SET
PI10.Signal=GPIO_Output
PI11.GPIOParameters=PinState,GPIO_Label
PI11.GPIO_Label=Pix11_Xs
PI11.Locked=true
PI11.PinState=GPIO_PIN_SET
PI11.Signal=GPIO_Output
PI12.GPIOParameters=PinState,GPIO_Label
PI12.GPIO_Label=Pix11_Dir
PI12.Locked=true
PI12.PinState=GPIO_PIN_RESET
PI12.Signal=GPIO_Output
PI13.GPIOParameters=PinState,GPIO_Label
PI13.GPIO_Label=Pix11_En
PI13.Locked=true
PI13.PinState=GPIO_PIN_SET
PI13.Signal=GPIO_Output
PI14.GPIOParameters=PinState,GPIO_Label
PI14.GPIO_Label=Pix11_Xs
PI14.Locked=true
PI14.PinState=GPIO_PIN_SET
PI14.Signal=GPIO_Output
PI15.GPIOParameters=PinState,GPIO_Label
PI15.GPIO_Label=Pix17_En
PI15.Locked=true
PI15.PinState=GPIO_PIN_SET
PI15.Signal=GPIO_Output
PI2.GPIOParameters=PinState,GPIO_Label
PI2.GPIO_Label=Pix33_PW
PI2.Locked=true
PI2.PinState=GPIO_PIN_SET
PI2.Signal=GPIO_Output
PI6.GPIOParameters=PinState,GPIO_Label
PI6.GPIO_Label=Pix08_PW
PI6.Locked=true
PI6.PinState=GPIO_PIN_SET
PI6.Signal=GPIO_Output
PI7.GPIOParameters=PinState,GPIO_Label
PI7.GPIO_Label=Pix08_Dir
PI7.Locked=true
PI7.PinState=GPIO_PIN_RESET
PI7.Signal=GPIO_Output
PI8.GPIOParameters=PinState,GPIO_Label
PI8.GPIO_Label=Pix09_Xs
PI8.Locked=true
PI8.PinState=GPIO_PIN_SET
PI8.Signal=GPIO_Output
PI9.GPIOParameters=PinState,GPIO_Label
PI9.GPIO_Label=Pix10_Dir
PI9.Locked=true
PI9.PinState=GPIO_PIN_RESET
PI9.Signal=GPIO_Output
PJ0.GPIOParameters=PinState,GPIO_Label
PJ0.GPIO_Label=Pix17_Dir
PJ0.Locked=true
PJ0.PinState=GPIO_PIN_RESET
PJ0.Signal=GPIO_Output
PJ1.GPIOParameters=PinState,GPIO_Label
PJ1.GPIO_Label=Pix17_PW
PJ1.Locked=true
PJ1.PinState=GPIO_PIN_SET
PJ1.Signal=GPIO_Output
PJ10.GPIOParameters=PinState,GPIO_Label
PJ10.GPIO_Label=Pix27_En
PJ10.Locked=true
PJ10.PinState=GPIO_PIN_SET
PJ10.Signal=GPIO_Output
PJ11.GPIOParameters=PinState,GPIO_Label
PJ11.GPIO_Label=Pix27_Dir
PJ11.Locked=true
PJ11.PinState=GPIO_PIN_RESET
PJ11.Signal=GPIO_Output
PJ12.GPIOParameters=PinState,GPIO_Label
PJ12.GPIO_Label=Pix03_Dir
PJ12.Locked=true
PJ12.PinState=GPIO_PIN_RESET
PJ12.Signal=GPIO_Output
PJ13.GPIOParameters=PinState,GPIO_Label
PJ13.GPIO_Label=Pix03_En
PJ13.Locked=true
PJ13.PinState=GPIO_PIN_SET
PJ13.Signal=GPIO_Output
PJ14.GPIOParameters=PinState,GPIO_Label
PJ14.GPIO_Label=Pix03_Xs
PJ14.Locked=true
PJ14.PinState=GPIO_PIN_SET
PJ14.Signal=GPIO_Output
PJ15.GPIOParameters=PinState,GPIO_Label
PJ15.GPIO_Label=Pix04_PW
PJ15.Locked=true
PJ15.PinState=GPIO_PIN_SET
PJ15.Signal=GPIO_Output
PJ2.GPIOParameters=PinState,GPIO_Label
PJ2.GPIO_Label=Pix18_Xs
PJ2.Locked=true
PJ2.PinState=GPIO_PIN_SET
PJ2.Signal=GPIO_Output
PJ3.GPIOParameters=PinState,GPIO_Label
PJ3.GPIO_Label=Pix18_En
PJ3.Locked=true
PJ3.PinState=GPIO_PIN_SET
PJ3.Signal=GPIO_Output
PJ4.GPIOParameters=PinState,GPIO_Label
PJ4.GPIO_Label=Pix18_Dir
PJ4.Locked=true
PJ4.PinState=GPIO_PIN_RESET
PJ4.Signal=GPIO_Output
PJ5.GPIOParameters=PinState,GPIO_Label
PJ5.GPIO_Label=Pix22_Dir
PJ5.Locked=true
PJ5.PinState=GPIO_PIN_RESET
PJ5.Signal=GPIO_Output
PJ6.GPIOParameters=PinState,GPIO_Label
PJ6.GPIO_Label=Pix26_En
PJ6.Locked=true
PJ6.PinState=GPIO_PIN_SET
PJ6.Signal=GPIO_Output
PJ7.GPIOParameters=PinState,GPIO_Label
PJ7.GPIO_Label=Pix26_Dir
PJ7.Locked=true
PJ7.PinState=GPIO_PIN_RESET
PJ7.Signal=GPIO_Output
PJ8.GPIOParameters=PinState,GPIO_Label
PJ8.GPIO_Label=Pix26_PW
PJ8.Locked=true
PJ8.PinState=GPIO_PIN_SET
PJ8.Signal=GPIO_Output
PJ9.GPIOParameters=PinState,GPIO_Label
PJ9.GPIO_Label=Pix27_Xs
PJ9.Locked=true
PJ9.PinState=GPIO_PIN_SET
PJ9.Signal=GPIO_Output
PK0.GPIOParameters=PinState,GPIO_Label
PK0.GPIO_Label=Pix27_PW
PK0.Locked=true
PK0.PinState=GPIO_PIN_SET
PK0.Signal=GPIO_Output
PK1.GPIOParameters=PinState,GPIO_Label
PK1.GPIO_Label=Pix28_Xs
PK1.Locked=true
PK1.PinState=GPIO_PIN_SET
PK1.Signal=GPIO_Output
PK2.GPIOParameters=PinState,GPIO_Label
PK2.GPIO_Label=Pix28_En
PK2.Locked=true
PK2.PinState=GPIO_PIN_SET
PK2.Signal=GPIO_Output
PK3.GPIOParameters=PinState,GPIO_Label
PK3.GPIO_Label=Pix05_Xs
PK3.Locked=true
PK3.PinState=GPIO_PIN_SET
PK3.Signal=GPIO_Output
PK4.GPIOParameters=PinState,GPIO_Label
PK4.GPIO_Label=Pix06_PW
PK4.Locked=true
PK4.PinState=GPIO_PIN_SET
PK4.Signal=GPIO_Output
PK5.GPIOParameters=PinState,GPIO_Label
PK5.GPIO_Label=Pix06_Dir
PK5.Locked=true
PK5.PinState=GPIO_PIN_RESET
PK5.Signal=GPIO_Output
PK6.GPIOParameters=PinState,GPIO_Label
PK6.GPIO_Label=Pix06_En
PK6.Locked=true
PK6.PinState=GPIO_PIN_SET
PK6.Signal=GPIO_Output
PK7.GPIOParameters=PinState,GPIO_Label
PK7.GPIO_Label=Pix06_Xs
PK7.Locked=true
PK7.PinState=GPIO_PIN_SET
PK7.Signal=GPIO_Output
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F767BGTx
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.17.4
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=Talma_NodeBoard_Git.ioc
ProjectManager.ProjectName=Talma_NodeBoard_Git
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_CAN1_Init-CAN1-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_I2C2_Init-I2C2-false-HAL-true,6-MX_I2C4_Init-I2C4-false-HAL-true,7-MX_USART2_UART_Init-USART2-false-HAL-true,8-MX_I2C3_Init-I2C3-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
RCC.AHBFreq_Value=216000000
RCC.APB1CLKDivider=RCC_HCLK_DIV4
RCC.APB1Freq_Value=54000000
RCC.APB1TimFreq_Value=108000000
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB2Freq_Value=108000000
RCC.APB2TimFreq_Value=216000000
RCC.CECFreq_Value=32786.88524590164
RCC.CortexFreq_Value=216000000
RCC.DFSDMAudioFreq_Value=192000000
RCC.DFSDMFreq_Value=108000000
RCC.EthernetFreq_Value=216000000
RCC.FCLKCortexFreq_Value=216000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=216000000
RCC.HSE_VALUE=8000000
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=54000000
RCC.I2C2Freq_Value=54000000
RCC.I2C3Freq_Value=54000000
RCC.I2C4Freq_Value=54000000
RCC.I2SFreq_Value=192000000
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,DFSDMAudioFreq_Value,DFSDMFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LCDTFTFreq_Value,LPTIM1Freq_Value,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLRFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,PLLSourceVirtual,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMC2Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART1Freq_Value,USART2CLockSelection,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
RCC.LCDTFTFreq_Value=96000000
RCC.LPTIM1Freq_Value=54000000
RCC.LSI_VALUE=32000
RCC.MCO2PinFreq_Value=216000000
RCC.PLLCLKFreq_Value=216000000
RCC.PLLI2SPCLKFreq_Value=192000000
RCC.PLLI2SQCLKFreq_Value=192000000
RCC.PLLI2SRCLKFreq_Value=192000000
RCC.PLLI2SRoutputFreq_Value=192000000
RCC.PLLM=4
RCC.PLLN=216
RCC.PLLQCLKFreq_Value=216000000
RCC.PLLQoutputFreq_Value=216000000
RCC.PLLRFreq_Value=216000000
RCC.PLLSAIPCLKFreq_Value=192000000
RCC.PLLSAIQCLKFreq_Value=192000000
RCC.PLLSAIRCLKFreq_Value=192000000
RCC.PLLSAIoutputFreq_Value=192000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.RNGFreq_Value=216000000
RCC.SAI1Freq_Value=192000000
RCC.SAI2Freq_Value=192000000
RCC.SDMMC2Freq_Value=216000000
RCC.SDMMCFreq_Value=216000000
RCC.SPDIFRXFreq_Value=192000000
RCC.SYSCLKFreq_VALUE=216000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.UART4Freq_Value=54000000
RCC.UART5Freq_Value=54000000
RCC.UART7Freq_Value=54000000
RCC.UART8Freq_Value=54000000
RCC.USART1Freq_Value=108000000
RCC.USART2CLockSelection=RCC_USART2CLKSOURCE_HSI
RCC.USART2Freq_Value=16000000
RCC.USART3Freq_Value=54000000
RCC.USART6Freq_Value=108000000
RCC.USBFreq_Value=216000000
RCC.VCOI2SOutputFreq_Value=384000000
RCC.VCOInputFreq_Value=2000000
RCC.VCOOutputFreq_Value=432000000
RCC.VCOSAIOutputFreq_Value=384000000
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
SH.S_TIM3_CH4.ConfNb=1
TIM3.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
TIM3.IPParameters=Channel-PWM Generation4 CH4,Prescaler,Period
TIM3.Period=10000
TIM3.Prescaler=10
USART2.BaudRate=9600
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
USART2.VirtualMode-Asynchronous=VM_ASYNC
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
board=custom
rtos.0.ip=FREERTOS
isbadioc=false
